Revit 2027 API
ParameterTypeId.FabricationMaterialAbbreviation Property
 "Material Abbreviation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationMaterialAbbreviation { get; }
Public Shared ReadOnly Property FabricationMaterialAbbreviation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationMaterialAbbreviation {
	ForgeTypeId^ get ();
}
static member FabricationMaterialAbbreviation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace